app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" ORDER BY "tasks"."completion_date" DESC
---
  def index
    @tasks = Task.all.order(:completion_date).reverse_order

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def show
    id = params[:id].to_i
    @task = Task.find_by(id: id)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @task = Task.find(params[:id].to_i)

INSERT INTO "tasks" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Hello"], ["description", "What"], ["created_at", "2018-10-04 03:29:08.349561"], ["updated_at", "2018-10-04 03:29:08.349561"]]
---
  def create
    @task = Task.new(task_params)

    if @task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "tasks" SET "name" = $1, "completion_date" = $2, "updated_at" = $3 WHERE "tasks"."id" = $4  [["name", "Revisit Hotel"], ["completion_date", 0], ["updated_at", "2018-09-20 03:06:16.011026"], ["id", 4]]
UPDATE "tasks" SET "description" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["description", "Read Ch. 4 and answer comprehension questions"], ["updated_at", "2018-09-19 22:19:48.909109"], ["id", 5]]
---
    task = Task.find(params[:id].to_i)
    task.update(task_params)

    if task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "tasks" SET "completion_date" = $1, "status" = $2, "updated_at" = $3 WHERE "tasks"."id" = $4  [["completion_date", "2018-09-20"], ["status", "Unmark Complete"], ["updated_at", "2018-09-20 02:45:40.360912"], ["id", 3]]
---
    task = Task.find(params[:id].to_i)
    if task.completion_date == nil
      task.completion_date = Date.current
      task.status = "Unmark Complete"
    else
      task.completion_date = nil
      task.status = "Mark Complete"
    end

    if task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 15]]
---
    task = Task.find_by(id: params[:id].to_i)
    task.destroy